# OpenClaw Franchise — Full Mac Mini Setup
# Run: brew bundle --file=Brewfile

# ═══════════════════════════════════════
# Taps (custom formula repositories)
# ═══════════════════════════════════════
tap "steipete/tap"
tap "antoniorodr/memo"

# ═══════════════════════════════════════
# Core Infrastructure
# ═══════════════════════════════════════
brew "git"
brew "jq"
brew "curl"
brew "sqlite"
brew "tmux"

# Docker + Database
cask "docker"

# Networking
brew "tailscale"
brew "cloudflared"
brew "sshpass"

# ═══════════════════════════════════════
# Messaging Channels
# ═══════════════════════════════════════
cask "bluebubbles"

# ═══════════════════════════════════════
# Development Tools
# ═══════════════════════════════════════
cask "zed"
brew "gh"
brew "deno"
brew "go"
brew "uv"
brew "pipx"

# ═══════════════════════════════════════
# Remote Management
# ═══════════════════════════════════════
cask "1password"
cask "1password-cli"
cask "google-chrome"

# ═══════════════════════════════════════
# AI / LLM Tools
# ═══════════════════════════════════════
brew "gemini-cli"

# ═══════════════════════════════════════
# Media + Content
# ═══════════════════════════════════════
brew "ffmpeg"
brew "yt-dlp"
brew "openai-whisper"

# MLX Whisper (Apple Silicon optimized — installed via pipx in install.sh)
# pipx install mlx-whisper

# ═══════════════════════════════════════
# OpenClaw Skills Dependencies (steipete/tap)
# ═══════════════════════════════════════
brew "bird"
brew "wacli"
brew "himalaya"
brew "imsg"
brew "antoniorodr/memo/memo"
brew "remindctl"
brew "peekaboo"
brew "gogcli"
brew "goplaces"
brew "sag"
brew "gifgrep"
brew "songsee"
brew "ordercli"
brew "camsnap"
brew "summarize"

# ═══════════════════════════════════════
# System Monitoring
# ═══════════════════════════════════════
cask "stats"
cask "codexbar"

# ═══════════════════════════════════════
# Database Tools
# ═══════════════════════════════════════
brew "postgresql@16"
brew "libpq"
brew "supabase"
