# OpenClaw Franchise — Full Mac Mini Setup
# Run: brew bundle --file=Brewfile

# ═══════════════════════════════════════
# Taps (custom formula repositories)
# ═══════════════════════════════════════
tap "steipete/tap"
tap "antoniorodr/memo"

# ═══════════════════════════════════════
# Core Infrastructure
# ═══════════════════════════════════════
brew "git"
brew "jq"
brew "curl"
brew "sqlite"
brew "tmux"

# Docker (for Neo4j)
cask "docker"

# Networking / Remote Access
brew "tailscale"
brew "cloudflared"
brew "sshpass"

# ═══════════════════════════════════════
# Messaging Channels
# ═══════════════════════════════════════
cask "bluebubbles"

# ═══════════════════════════════════════
# Development Tools
# ═══════════════════════════════════════
cask "zed"
brew "gh"
brew "deno"
brew "go"
brew "uv"
brew "pipx"

# ═══════════════════════════════════════
# Remote Management
# ═══════════════════════════════════════
cask "1password"
cask "1password-cli"
cask "google-chrome"

# ═══════════════════════════════════════
# AI / LLM Tools
# ═══════════════════════════════════════
brew "gemini-cli"

# ═══════════════════════════════════════
# Media + Content
# ═══════════════════════════════════════
brew "ffmpeg"
brew "yt-dlp"
brew "openai-whisper"

# ═══════════════════════════════════════
# OpenClaw Skills Dependencies
# ═══════════════════════════════════════
# bird — deleted from steipete/tap; installed separately via cargo/binary in Step 4
brew "steipete/tap/wacli"
brew "himalaya"
brew "steipete/tap/imsg"
brew "antoniorodr/memo/memo"
brew "steipete/tap/remindctl"
brew "steipete/tap/peekaboo"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/sag"
brew "steipete/tap/gifgrep"
brew "steipete/tap/songsee"
brew "steipete/tap/ordercli"
brew "steipete/tap/camsnap"
brew "steipete/tap/summarize"

# ═══════════════════════════════════════
# System Monitoring
# ═══════════════════════════════════════
cask "stats"
cask "codexbar"

# ═══════════════════════════════════════
# Database Tools
# ═══════════════════════════════════════
brew "postgresql@16"
brew "libpq"
brew "supabase"
